caseFiles/system/fluidZone/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
boundary
{
    inlet 
    {
        type        patch;
    }
    outlet
    {
        type        patch;
    }
    bottom
    {
        type        wall;
    }
    top
    {
        type        wall;
    }
    frontFluid
    {
        type        empty;
    }    
    backFluid
    {
        type        empty;
    }
}
U
{
    internalField   uniform (0.001 0 0);

    boundaryField
    {
        inlet
        {
            type            fixedValue;
            value           uniform (0.001 0 0);
        }

        outlet
        {
            type            inletOutlet;
            inletValue      uniform (0 0 0);
        }
	frontFluid
    	{
            type        empty;
    	}    
    	backFluid
    	{
            type        empty;
    	}

        ".*"
        {
            type            fixedValue;
            value           uniform (0 0 0);
        }
	

    }
}

T
{
    internalField   uniform 300;

    boundaryField
    {
        inlet
        {
            type            fixedValue;
            value           uniform 300;
        }

        outlet
        {
            type            inletOutlet;
            inletValue      uniform 300;
        }

        ".*"
        {
            type            zeroGradient;
            value           uniform 300;
        }
	frontFluid
    	{
            type        empty;
    	}    
    	backFluid
    	{
            type        empty;
    	}

        fluidZone_to_solidZone
        {
            type            compressible::turbulentTemperatureCoupledBaffleMixed;
            Tnbr            T;
            kappaMethod     fluidThermo;
            value           uniform 1000;
        }
    }
}

epsilon
{
    internalField   uniform 0.01;

    boundaryField
    {
        inlet
        {
            type            fixedValue;
            value           uniform 0.01;
        }

        outlet
        {
            type            inletOutlet;
            inletValue      uniform 0.01;
        }
	frontFluid
    	{
            type        empty;
    	}    
    	backFluid
    	{
            type        empty;
    	}

        ".*"
        {
            type            epsilonWallFunction;
            value           uniform 0.01;
        }
    }
}

k
{
    internalField   uniform 0.1;

    boundaryField
    {
        inlet
        {
            type            inletOutlet;
            inletValue      uniform 0.1;
        }

        outlet
        {
            type            zeroGradient;
            value           uniform 0.1;
        }
	frontFluid
    	{
            type        empty;
    	}    
    	backFluid
    	{
            type        empty;
    	}

        ".*"
        {
            type            kqRWallFunction;
            value           uniform 0.1;
        }
    }
}

p_rgh
{
    internalField   uniform 0;

    boundaryField
    {
        inlet
        {
            type            zeroGradient;
            value           uniform 0;
        }

        outlet
        {
            type            fixedValue;
            value           uniform 0;
        }
	frontFluid
    	{
            type        empty;
    	}    
    	backFluid
    	{
            type        empty;
    	}

        ".*"
        {
            type            fixedFluxPressure;
            value           uniform 0;
        }
    }
}

p
{
    internalField   uniform 0;

    boundaryField
    {
        ".*"
        {
            type            calculated;
            value           uniform 0;
        }
	frontFluid
    	{
            type        empty;
    	}    
    	backFluid
    	{
            type        empty;
    	}
    }
}

// ************************************************************************* //
